{
    "file_types": [".html", ".css"],
    "criteria": [
      {
        "category": "Standard & teknik",
        "steps": [
            {
                "description": "HTML-koden inuti body-elementet innehåller HTML-elementen: h1, h2, p, a, img, table; och har valid struktur enligt HTML5-standard.",
                "grade": "E",
                "fulfilled": "",
                "comment": "Villkor för att uppfylla kriteriersteget: Gäller bara HTML-filer. HTML-koden består av minst 2 nivåer av nästlade element inuti body-elementet. Exempelvis ska table innehålla tr och td på korrekt sätt."
            },
          {
            "description": "Webbplatsen ska bestå av 5 sidor med korrekt HTML5-struktur där varje sida innehåller en bild med bildtext, en horisontell meny och en sidfot med en länk till Wikipedia, där texten formateras med sans-serif. Webbsidan skall byggas med korrekt semantiska HTML-element och CSS-regler.",
            "grade": "C",
            "fulfilled": "",
            "comment": "Villkor: HTML-filerna ska ha giltig struktur och inkludera alla specificerade element."
          },
          {
            "description": "Huvudcontainern ska vara centrerad med en maxbredd på ca 700px. Rubriken och menyn ska formateras med Google Fonts Montserrat enligt angiven CSS-import. Menyn ska ha gråa knappar med ljusgrå indikation för den aktiva sidan.",
            "grade": "C",
            "fulfilled": "",
            "comment": "Villkor: CSS-stilar ska tydligt markera aktivt tillstånd med korrekt färgskala."
          }
        ]
      },
      {
        "category": "Praxis & kvalitet",
        "steps": [
          {
            "description": "All kod (HTML och CSS) ska vara välkommenterad och indenterad enligt god praxis.",
            "grade": "E",
            "fulfilled": "",
            "comment": "Villkor: Kommentarer och konsekvent indentering underlättar läsbarhet och underhåll."
          },
          {
            "description": "Filer ska vara namngivna med små bokstäver och bindestreck istället för mellanslag, och koden ska ha en logisk struktur.",
            "grade": "E",
            "fulfilled": "",
            "comment": "Villkor: Filnamn och mappstruktur ska följa de angivna riktlinjerna."
          },
          {
            "description": "En CSS-reset ska användas för att säkerställa enhetliga utgångsvärden i webbläsaren.",
            "grade": "E",
            "fulfilled": "",
            "comment": "Villkor: CSS-reset regler ska inkluderas i CSS-filerna."
          }
        ]
      },
      {
        "category": "Tillgänglighet",
        "steps": [
          {
            "description": "Bilder ska ha beskrivande alt-attribut och HTML-dokumentet ska ange språket som sv.",
            "grade": "E",
            "fulfilled": "",
            "comment": "Villkor: Minst en bild per sida ska ha alt-text och språkattributet ska vara korrekt satt."
          }
        ]
      }
    ]
  }
  